#################################################+++++++++++++++++++++++++++++++++++++++ константы
import math
import numpy as np

'''WIDTH = 1280  # Ширина окна
HEIGHT = 720  # Высота окна'''

EPSILON = 0.01  # Расстояние, на котором можно считать, что мы пришли в точку
MAX_DEPTH = 100  # Максимальная длина луча
MAX_STEPS = 15  # Максимальное количество шагов в глубину

light_pos = (4.0, 3.0, 4.0)

# colors
FON = (47, 79, 79)
DARKGRAY = (15, 15, 15)
BLACK = (0, 0, 0)
WHITE = (255, 255, 255)
BLUE = (0, 0, 255)
BLUE_SKY = (0, 189, 255)
BROWN = (140, 50, 20)
DARKBLUE = (0, 0, 70)
DGRAY = (30, 30, 30)
DARKRED = (80, 0, 0)
DARKGREEN = (6, 51, 9)
DARKYELLOW = (155, 135, 12)
GRAY = (100, 100, 100)
GREEN = (0, 255, 0)
LIGHTBLUE = (100, 100, 225)
LIGHTGRAY = (150, 150, 150)
LIGHTGREEN = (100, 255, 100)
RED = (255, 0, 0)
YELLOW = (255, 255, 0)
